{
    "experiences": [
    {
      "id": "alloy-2021",
      "name": "Alloy",
      "url": "https://www.alloy.com/",
      "title": "Senior Software Engineer",
      "period": "Oct 2021 - Present",
      "location": "New York, NY",
      "items": [
        "Working in Policy Experience/Dashboard team",
        "Leading Front-end Service Architecture work",
        "Led Front-end build working group, delivered the first stage of pipeline overhaul leading to build time reduction achievements (up to 50%), runtime enhancements.",
        "Facilitated Redux working group and delivered the first spec pattern and implementation.",
        "Implemented a new modern icon renderer/transpilation pipeline with an automatic view box adjustment."
      ]
    },
    {
      "id": "aetna-cvs-2020",
      "name": "Aetna, Analytics & Behavior Change",
      "url": "https://www.aetna.com/",
      "title": "Senior Web Engineer",
      "period": "Jul 2020 — Oct 2021",
      "location": "New York, NY",
      "items": [
        "Led the web engineering team and engineering initiatives for self-service API backend services and web front-end application.",
        "Led the major front-end development of migrating the legacy web front-end and outdated architecture into a redesigned modern React front-end SPA architecture. (Led engineering initiative/architecture and developed most of the new code)",
        "Led self-servicing API service (Node.js) refactor design.",
        "Established web engineering patterns and practices.",
        "Leading web engineering patterns and practices on a high-level for the team.",
        "Worked with a product manager for conducting customer UX research for building user personas, UX initiatives/workflow.",
        "Identified feature/experience gaps and led front-end UI/UX development for features.",
        "Designed and developed a UI core processing engine that performs schema model composition, custom model abstraction, delta chunk rendering and dispatch using tree address structure, dynamic quality evaluation/rule-driven suggestion post-processing pipeline — avg. 500% faster on visualizing/rendering JSON configuration data of 40K lines.",
        "Designed and developed a Journey Flow Builder with free-form canvas, drag-and-draw experience, automatic step flow routing with dynamic sequence index assignment, automatic flow error detection/correction, step flow route aggregation and route branching.",
        "Designed and developed dynamic object renderers with automatic layout composition based on object type and module characteristics.",
        "Designed and developed an in-house UI components based on design system and an overlay rendering component/context that consists of context menu, popover, modal, and window with dynamic depth and layout positioning."
      ]
    },
    {
      "id": "rally-2019",
      "name": "Rally Rd. (RSE Markets)",
      "url": "https://rallyrd.com/",
      "title": "Software Engineer (Front-end/Full-stack)",
      "period": "Oct 2019 — Jul 2020",
      "location": "New York, NY",
      "items": [
        "Primary engineer and maintainer of the main React web front-end and Android PWA application codebase for its alternative asset investing web application.",
        "Maintained/updated git repository strategy along with CI pipeline configuration to have succinct commit history, better branch merge/conflict management, and CI test hook integration (CircleCI).",
        "Introduced a new network connection error handler for a better detection/user-bound error messaging",
        "Developed a custom gesture-based carousel component for Web and Android for asset browsing experience",
        "Developed a custom modal view controller optimized for Web/Android"
      ]
    },
    {
      "id": "toastlabs-2015",
      "name": "Toast Labs",
      "url": "",
      "title": "Full-stack Lead/Founder",
      "period": "Apr 2015 — Jul 2017",
      "location": "Palo Alto, CA",
      "items": [
        "Led a technology startup company that developed and launched mobile applications, including “#Newsrooms”, which provided a solution for journalistic bias through an automatically generated news briefing.",
        "Custom-designed hybrid UI framework for the products in JavaScript.",
        "Developed a Node.js/MongoDB backend running a number of RESTful API endpoints and a custom natural language processing pipeline for “#Newsrooms”.",
        "Designed the user experience of the products.",
        "Custom-designed geofence engine for low-power location tracking in Objective-C: geofence target prediction/calculation based on real-time movement data"
      ]
    }
  ]
}